# 01. Exercise follow along - cleaning prods dataframe

## Importing libraries

In [2]:
# Importing libraries
import pandas as pd
import numpy as np
import os

## Importing dataframes

In [3]:
# Importing orders dataframe 
path = r'C:\Users\lydia\OneDrive\Documents\Career Foundry Data\Data Immersion\Acheivement 4\Instacart Basket Analysis May-2023'
ord_df = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [4]:
# Importing products dataframe
prod_df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

## Data consistency checks

In [5]:
ord_df.describe()
# order days of week is consistent as has min of 0 and max of 6 - therefore 7 values for each day of the week
# order hour of the day consistent as max doesn't go above 24

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Mixed-Type Data

In [6]:
# Create a dataframe
df_test = pd.DataFrame()

In [7]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [8]:
df_test

    mix
0     a
1     b
2     1
3  True

In [9]:
# Checking if a dataframe contains a mixed-type column
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [10]:
# Changing data type
df_test['mix'] = df_test['mix'].astype('str')

## Missing Values

In [11]:
# Finding missing values 
prod_df.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
# Creating a subset for the missing values
df_nan = prod_df[prod_df['product_name'].isnull() == True]

In [13]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
# Determine how many rows and columns the dataframe has before removing missing rows
prod_df.shape

(49693, 5)

In [15]:
# Create a new dataframe without the missing values
prod_df_clean = prod_df[prod_df['product_name'].isnull() == False]

In [18]:
# Checking the number of rows after removing missing values
prod_df_clean.shape

(49677, 5)

In [19]:
# Other codes to remove missing values
# prod_df.dropna(inplace = True)
# prod_df.dropna(subset = [‘product_name’], inplace = True)

## Duplicates

In [20]:
# Checking for full duplicates in dataframe
df_dups = prod_df_clean[prod_df_clean.duplicated()]

In [21]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [22]:
# Checking number of rows before deleting duplicates
prod_df_clean.shape

(49677, 5)

In [23]:
# Deleting duplicates
prod_df_clean_no_dups = prod_df_clean.drop_duplicates()

In [24]:
# Checking number of rows after deleting duplicates
prod_df_clean_no_dups.shape

(49672, 5)

## Exporting new dataframe

In [25]:
prod_df_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

# 02. Assessing order dataframe

In [26]:
ord_df.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [27]:
# Drop unnamed column
ord_df = ord_df.drop(columns = ['Unnamed: 0'])

In [29]:
# Check dataframe columns
ord_df.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_last_order'],
      dtype='object')

Descriptive statistics for ord_df appears to be normal

# 03. Mixed-type data

In [30]:
# Checking for mixed-type data in ord_df
for col in ord_df.columns.tolist():
  weird = (ord_df[[col]].applymap(type) != ord_df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (ord_df[weird]) > 0:
    print (col)

04. No mixed-type data identified for ord_df

# 05. Missing Values

In [31]:
# Finding missing values 
ord_df.isnull().sum()

order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

In [32]:
# Create a subset for the missing values
ord_df_nan = ord_df[ord_df['days_since_last_order'].isnull() == True]

In [33]:
# Checking subset rows
ord_df_nan.shape

(206209, 6)

In [34]:
ord_df_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

Order number is 1 for all of these missing values which suggests that this was the first time order, hence having no value for previous order.

06. I have chosen not to make any changes as I don't believe inputting any other values would be helpful. The column is a numerical volume and so putting a string value would not be helpful and any other numerical value would be confusing.

# 07. Duplicates

In [36]:
# Checking for full duplicates in dataframe
ord_df_dups = ord_df[ord_df.duplicated()]

In [37]:
ord_df_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

08. No duplicates detected

# 09. Export order data

In [38]:
ord_df.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'))